app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions"
---
  def index
    @auctions = Auction.all

INSERT INTO "auctions" ("name_of_event", "organization", "image_data", "date", "start_time", "duration", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @auction = Auction.new(auction_params)
    @auction.user = current_user

    if @auction.save

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 2]]
---
  def destroy
    @auction = Auction.find(params[:id])
    @auction.destroy